---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.StructFramJoinStatus
source: html/c5e7255c-2276-18c7-1b6d-af3ef43d72d0.htm
---
# Autodesk.Revit.DB.ParameterTypeId.StructFramJoinStatus Property

"Join Status"

## Syntax (C#)
```csharp
public static ForgeTypeId StructFramJoinStatus { get; }
```